# # 1. Квадрат числа.
# #
# number = int(input("Введите число для возведения в квадрат:\n"))
# print(f"Вы ввели: {number}. Квадрат ввденого числа: {number ** 2}")
# #
# # 2. “Середнє трьох чисел”
# #
# print("Необходимо по очереди ввести 3 целых числа для вычисления среднеарифметического")
# number_1 = int(input("Введите 1 число:\n"))
# number_2 = int(input("Введите 2 число:\n"))
# number_3 = int(input("Введите 3 число:\n"))
# print(f"Вы ввели: {number_1},{number_2},{number_3}. Среднеарифметическоге от введеных чисел: {(number_1 + number_2 + number_3)/3}")
# #
# # 3. “Перетворення хвилин у години”
# minutes_raw = int(input("Введте целое число минут для приведения к виду: N часов M минут\n"))
# hours, minutes = divmod(minutes_raw, 60)
# #
# print(f"Вы ввели: {minutes_raw}. Отформатированные данные: {hours} час. {minutes} мин.")
# #
# # 4. “Розрахунок знижки”
# #
# price = float(input("Введите цену товара:\n"))
# sale = float(input("Введите скидкe (%):\n"))
# print(f"Цена со скидкой: {price - (price / 100 * sale)}")
# #
# # 5. “Остання цифра числа”
# #
# number = int(input("Введите целое число:\n"))
# print(f"Последней цифрой числа {number} является {number % 10 } ")
# #
# # 6. “Периметр прямокутника”
# #
# print("Для вычислений периметра прямугольника необходимо ввести его длину и ширину.")
# side_a = float(input("Введите длину прямоугольника:\n"))
# side_b = float(input("Введите ширину прямоугольника:\n"))
# print(f"Для введеных параметров длины {side_a} и ширины {side_b} прямоугольника его периметр будет равен: {(side_a+side_b) * 2} ")
# #
# # 7. Виведення числа в стовпчик
#
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
#
number = int(input("Введите целое 4х значное число для выведения в столбик всех его разрядов:\n"))
print(f"Четвертый разряд числа {number}: {number // 1000}")
print(f"Третий разряд числа {number}: {number // 100}")
print(f"Второй разряд числа {number}: {number // 10}")
print(f"Первый разряд числа {number}: {number % 10}")
# 1
#
# 2
#
# 3
#
# 4
#
# Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod). Виведення в стовпчик можна зробити за допомогою 4-х функцій print.
#
# Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число, яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.
#
# Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.
#
# Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-х значне.